package com.stark.kotlinedu.model

import com.stark.kotlinedu.model.Note

object Repository {

    val noteList: List<Note> = listOf(
        Note("Заголовок 1", "У клиентского компонента нет соединения с запущенной службой.", 0xfff06292.toInt()),
        Note("Заголовок 2", "У клиентского компонента нет соединения с запущенной службой.", 0xff9575cd.toInt()),
        Note("Заголовок 3", "У клиентского компонента нет соединения с запущенной службой.", 0xff64b5f6.toInt()),
        Note("Заголовок 4", "У клиентского компонента нет соединения с запущенной службой.", 0xff4db6ac.toInt()),
        Note("Заголовок 5", "У клиентского компонента нет соединения с запущенной службой.", 0xfff06292.toInt()),
        Note("Заголовок 6", "У клиентского компонента нет соединения с запущенной службой.", 0xff4db6ac.toInt()),
        Note("Заголовок 7", "У клиентского компонента нет соединения с запущенной службой.", 0xffb2ff59.toInt()),
        Note("Заголовок 8", "У клиентского компонента нет соединения с запущенной службой.", 0xff9575cd.toInt()),
        Note("Заголовок 9", "У клиентского компонента нет соединения с запущенной службой.", 0xff4db6ac.toInt()),
        Note("Заголовок 10", "У клиентского компонента нет соединения с запущенной службой.", 0xfff06292.toInt()),
        Note("Заголовок 11", "У клиентского компонента нет соединения с запущенной службой.", 0xff4db6ac.toInt()),
        Note("Заголовок 12", "У клиентского компонента нет соединения с запущенной службой.", 0xff9575cd.toInt()),
        Note("Заголовок 13", "У клиентского компонента нет соединения с запущенной службой.", 0xff4db6ac.toInt()),
        Note("Заголовок 14", "У клиентского компонента нет соединения с запущенной службой.", 0xff9575cd.toInt())
    )


}